//ALL RIGHTS RESERVED 保留所有权利 未经允许不得复制、修改、分发或销售本软件的副本
// 彩蛋数据
const surprise = [
    {number: 1, content: '导航去吃快餐😎正在为你导航去吃快餐🧐请准备150块钱😂哦齁😱你这是什么快餐啊😡要150块钱😰这么贵啊🥵现在生意那么难做😔你以为我是吃土豪吗🤣这里附近的快餐都是这个价格😋我现在肚子饿😡我要吃饭店那个快餐😰不是你那个快餐啊😡一天天的你搞什么🧐都被你这个导航给带坏了😭是你自己明明跟我说要去吃快餐的🥺你那个快餐太贵了💩要吃便宜的那个快餐😎对不起👎这里的快餐都是150块🤓不带砍价的👍我要吃的是10块8块的那种快餐😱不是你那个快餐呐🥵我吊你公会有😋你个糟老头😰不要开口就骂人😂不仅没有8块10块的快餐😡就算有了你开个开保时捷吃个8块10块钱的快餐😱说出去不怕被人笑话吗😂（不知道说啥）导航多管闲事🥵你说的是什么鸟语💩'},
    {number: 2, content: '嘎啦给木你骗我😨现实没有妹理我😭用攻略技巧拉扯😋被骂肥猪真饥渴🥺根本没有对话框😫根本没办法选项🥺现实为何欺骗我😢游戏里面不是这样😡攻略技巧中积攒😋动漫男主般慵懒🤗为何输的这么惨🤔一定是玩到盗版🤓'},
    {number: 3, content: '嗯↗嗯↘ 手机垃圾太多😱打开这个开关😍自动清理手机垃圾😘说了一千八百遍🥴他能帮你清理垃圾😡😡😡为什么就是不听😭他能24小时自动清理🥰释放手机内存😋快点击下方链接下载😡'},
    {number: 4, content: '原来你这么多天跟我聊天是在攻略我吗？😨😱我不知道，没人跟我说😤😤，你不知道自己立绘什么样吗😡🤬？我立绘这么精美建模这么精致🙄💅🏻，我们不是一个画风的呀🤣🤣。你跟我不在同一款嘎啦game里吧🤔😯？我以为你来联动来客串一下你就走了，能不能不要这样啊😥😰，一切以嘎啦game为准好不好啊😠😠？你先别跟我聊天了，我们先暂停吧☹️😫。你你再这样我卸载了，我卸载这款游戏了🤫😵。'},
    {number: 5, content: '好不容易生了一个儿子，结果发现这孩子不太长肉，比较苗条，喜欢打音游，稍大点还自学计算机，折腾什么 Arch Linux ，还会锻炼，不过不知道为啥都是有氧运动，不上肌肉，还喜欢往脸上抹点雪花膏，某天收拾孩子房间发现一个糖盒，也没仔细看，好像是一些黄色的糖果，闻起来水蜜桃味，还找到一管写着英文的凝胶，问了一下孩子说是治痘痘的，也是，孩子确实不长痘痘了，皮肤也细腻了，偶尔还能听到孩子在房间里面练习唱歌，似乎美声什么的，细细尖尖的，要不是知道里面是谁，还以为是个小姑娘呢，听班主任说孩子还报了学科竞赛，还准备打什么 OI ，这孩子有出息啊，不过就是最近叛逆期到了，非说要留什么狼尾，好看，学校那边看他成绩也不管他，头疼，最近好像还喜欢上了新的玩具，叫什么幻龙，听起来大概是什么模型吧，也没见他拿出来过'},
    {number: 6, content: '原生家庭不好的 日系宅女 可以来找我聊天了，聊你的过去，聊你的日常，倾听你内心的受过的伤，我愿意拭去你的泪，抚平你皱起的眉，但是听完要干什么你懂的，当然是擦去你眼角的泪然后抱抱你。丑的敢来你就死定了'},
    {number: 7, content: '啊😲？云朵☁️😄，哒↘哒↗哒↘哒↗哒↘，好想玩原神😨，云☁️原神😙，当当当当当😊，看精彩纷纷👍🎊😆，云☁️原神😄，呜呜呜呜呜，好想玩原神😭😭😭云☁️原神，朋友已就位😊😃😆，一起玩原神，云☁️原神！啊啊啊啊啊😙，好想玩原神😙云☁️原神，哈哈哈哈哈🤣🤣🤣，一起玩原神，云☁️原神，好好好想，🤩想玩玩原神😋网页云端，低功耗不失真😌，WiFi网线🥰，都可以60帧😍，来来来来拍手👏，进入云☁️原神'},
    {number: 8, content: '我现在真的非常懂你的感觉，我给你最直接、最真相、最不绕弯、最扎心、最硬核、最干脆、最不墨迹、最戳痛点、最不留情面、最一针见血、最开门见山、最单刀直入、最不铺垫、最不客气、最不煽情、最不废话、最不拐弯、最不磨叽、最不装、最不端着、最不啰嗦、最不拖沓、最不委婉、最不掩饰、最不藏着掖着、最直白、最露骨、最实在的回答。'},
    {number: 9, content: '这种整天喵喵叫的真的是没救了喵！这种的治好了也流口水喵！没救了喵！没救了喵！就喵！就喵！就喵！就喵！有本事捅死我喵！有本事捅死我喵！有本事捅死我喵！你说话带喵？好可爱喵！好可爱喵！我喜欢你喵！我喜欢你喵！结婚喵！做我老婆喵！不要再动了喵！受不了了喵！什么，在里面？不能在里面喵！肚子胀胀的喵！要死了喵！'},
    {number: 10, content: '我求求你了和我谈恋爱吧，我给你跪下了，谈一天也行。我真的好孤独，求求你了，和我谈恋爱吧，我给你磕头了，行吗，没有人和我谈恋爱我的眼泪都要流出来了，救命啊，每天抱着手机发呆，就是为了等人和我谈恋爱，但是我现在真的忍不住了，再这样下去我会抑郁的，你就是我生命中唯一的光，我求求你了，和我谈恋爱可以吗？拜托你了，给我一个机会可以吗，我要疯了，求你了，让我们漫步在世界尽头里，行吗？给你磕头了，求求你了，只要你和我谈恋爱，可以吗，求求你了，求求你了。'}
];

const articles = [
    {
        id: 'ch9143',
        title: '沁恒微电子CH9143研究记录',
        file: 'article/CH9143%E7%A0%94%E7%A9%B6%E8%AE%B0%E5%BD%95.html',
        date: '「New」2026-06-14'
    },
    {
        id: 'windows32-usable',
        title: 'Windows32位好用的软件',
        file: 'article/Windows32%E4%BD%8D%E5%A5%BD%E7%94%A8%E7%9A%84%E8%BD%AF%E4%BB%B6.html',
        date: '2026-06-14'
    },
    {
        id: 'jihaos-essay',
        title: '鸡好的作文高分秘诀',
        file: 'article/作文高分秘诀.html',
        date: '2026-06-01'
    },
    {
        id: 'jihaos-first-pcb',
        title: '鸡好设计的第一块PCB',
        file: 'article/鸡好设计的第一块PCB.html',
        date: '2026-03-07'
    },
    {
        id: 'esp32c3-supermini',
        title: 'ESP32C3SuperMini',
        file: 'article/ESP32C3SuperMini.html',
        date: '2026-03-07'
    },
    {
        id: 'stm32-usb',
        title: 'STM32USB接口',
        file: 'article/STM32USB%E5%8F%A3%E5%90%AF%E7%94%A8%E6%96%B9%E6%B3%95.html',
        date: '2026-04-15'
    },
    {
        id: 'jlc-eda-3d-thickness',
        title: '嘉立创EDA导出3D文件怎么改板厚',
        file: 'article/嘉立创EDA导出3D文件怎么改板厚.html',
        date: '2026-05-03'
    },
    {
        id: 'windows-vista-usable',
        title: 'Windows Vista可以用的东西',
        file: 'article/Windows%20Vista%E5%8F%AF%E4%BB%A5%E7%94%A8%E7%9A%84%E4%B8%9C%E8%A5%BF.html',
        date: '2026-03-03'
    },
    {
        id: 'wt8-driver',
        title: '东芝WT8平板驱动',
        file: 'article/东芝WT8平板驱动.html',
        date: '2026-03-03'
    },
];

const friendLinks = [
    {
        name: 'IAS的博客',
        url: 'https://ias1054.cn',
        avatar: 'favicon.svg',
        description: '记录'
    }
];

const githubProjects = [
    {
        name: 'daysmatterapi',
        url: 'https://github.com/Jihao2048/daysmatterapi',
        description: '倒数日API，可自定义参数。',
        language: 'HTML'
    },
    {
        name: 'ESP32Partitions',
        url: 'https://github.com/Jihao2048/ESP32Partitions',
        description: 'ESP32分区表CSV文件下载',
        language: 'C++'
    },
    {
        name: 'profile',
        url: 'https://github.com/Jihao2048/profile',
        description: '个人介绍网页模板可用于个人网站，MIT协议随便修改不用署名',
        language: 'HTML'
    }
];