//ALL RIGHTS RESERVED 保留所有权利 未经允许不得复制、修改、分发或销售本软件的副本
const surprise = [
    {number: 1, content: '导航去吃快餐😎正在为你导航去吃快餐🧐请准备150块钱😂哦齁😱你这是什么快餐啊😡要150块钱😰这么贵啊🥵现在生意那么难做😔你以为我是吃土豪吗🤣这里附近的快餐都是这个价格😋我现在肚子饿😡我要吃饭店那个快餐😰不是你那个快餐啊😡一天天的你搞什么🧐都被你这个导航给带坏了😭是你自己明明跟我说要去吃快餐的🥺你那个快餐太贵了💩要吃便宜的那个快餐😎对不起👎这里的快餐都是150块🤓不带砍价的👍我要吃的是10块8块的那种快餐😱不是你那个快餐呐🥵我吊你公会有😋你个糟老头😰不要开口就骂人😂不仅没有8块10块的快餐😡就算有了你开个开保时捷吃个8块10块钱的快餐😱说出去不怕被人笑话吗😂（不知道说啥）导航多管闲事🥵你说的是什么鸟语💩'},
    {number: 2, content: '别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说别这么说'},
    {number: 3, content: '嗯↗嗯↘ 手机垃圾太多😱打开这个开关😍自动清理手机垃圾😘说了一千八百遍🥴他能帮你清理垃圾😡😡😡为什么就是不听😭他能24小时自动清理🥰释放手机内存😋快点击下方链接下载😡'},
    {number: 4, content: '骂人是错误行为。他就要明白、'},
    {number: 5, content: '我是小妖怪😈😈逍遥又自在🌀🌀杀人不眨眼🔪👀👀吃人不放盐🧂❌❌一口七八个😋😋肚子要撑破🤰💥💥茅房去拉屎💩🚽🚽想起忘带纸🧻😱😱哪吒若不是魔丸🔥🔥也一样被炼成丹💊💊那仙翁若没人撑腰👴🚫🚫他哪敢为非作歹😤👊👊那土拨鼠就算老实本分🐹😇😇也逃不过被砸了饭碗🥣💔💔那申公豹就算再努力🐆💪💪没背景也只能被玩弄掌心🖐️😔😔有人干了一辈子🛠️💦💦脏活累活只为几颗仙丹💊💊有人大手一挥✋💨💨几代人的努力全部都玩完💸😭😭人们总说心里的成见🧠🏔️🏔️就像一座大山⛰️⛰️有人肚子里全是山🏔️🏔️却叫别人肚里撑船⛵🌊🌊从今生死😌⚖️⚖️从来生死都看淡🌩️🤜🤜跟老天专和老天对着干✊🔥🔥'},
    {number: 6, content: '老板给我来碗忘情牛肉面🍜🍜不放眼泪😭🚫不放痛💔🚫放忘情汤🥣🥣我要忘记曾经你所有味道👋👋从此爱恨随意飘摇🌪️🌪️🍃🍃'},
    {number: 7, content: '啊😲？云朵☁️😄，哒↘哒↗哒↘哒↗哒↘，好想玩原神😨，云☁️原神😙，当当当当当😊，看精彩纷纷👍🎊😆，云☁️原神😄，呜呜呜呜呜，好想玩原神😭😭😭云☁️原神，朋友已就位😊😃😆，一起玩原神，云☁️原神！啊啊啊啊啊😙，好想玩原神😙云☁️原神，哈哈哈哈哈🤣🤣🤣，一起玩原神，云☁️原神，好好好想，🤩想玩玩原神😋网页云端，低功耗不失真😌，WiFi网线🥰，都可以60帧😍，来来来来拍手👏，进入云☁️原神'},
    {number: 8, content: '我现在真的非常懂你的感觉，我给你最直接、最真相、最不绕弯、最扎心、最硬核、最干脆、最不墨迹、最戳痛点、最不留情面、最一针见血、最开门见山、最单刀直入、最不铺垫、最不客气、最不煽情、最不废话、最不拐弯、最不磨叽、最不装、最不端着、最不啰嗦、最不拖沓、最不委婉、最不掩饰、最不藏着掖着、最直白、最露骨、最实在的回答。'},
    {number: 9, content: '这种整天喵喵叫的真的是没救了喵！这种的治好了也流口水喵！没救了喵！没救了喵！就喵！就喵！就喵！就喵！有本事捅死我喵！有本事捅死我喵！有本事捅死我喵！你说话带喵？好可爱喵！好可爱喵！我喜欢你喵！我喜欢你喵！结婚喵！做我老婆喵！不要再动了喵！受不了了喵！什么，在里面？不能在里面喵！肚子胀胀的喵！要死了喵！'},
    {number: 10, content: '小时候。经常。在旱厕。附近。捡蜗牛。吃。'}
];

const articles = [
    {
        id: 'stcusb',
        title: 'STC8H单片机USB功能初次体验',
        file: 'article/STC%E5%8D%95%E7%89%87%E6%9C%BAUSB%E5%8A%9F%E8%83%BD%E5%88%9D%E6%AC%A1%E4%BD%BF%E7%94%A8.html',
        date: '2026-08-01'
    },
    {
        id: 'wt8-driver',
        title: '东芝WT8平板驱动',
        file: 'article/东芝WT8平板驱动.html',
        date: '2026-06-25'
    },
    {
        id: 'ch9143',
        title: '沁恒微电子CH9143研究记录',
        file: 'article/CH9143%E7%A0%94%E7%A9%B6%E8%AE%B0%E5%BD%95.html',
        date: '2026-06-14'
    },
    {
        id: 'windows32-usable',
        title: 'Windows32位好用的软件',
        file: 'article/Windows32%E4%BD%8D%E5%A5%BD%E7%94%A8%E7%9A%84%E8%BD%AF%E4%BB%B6.html',
        date: '2026-06-14'
    },
    {
        id: 'esp32c3-supermini',
        title: 'ESP32C3SuperMini',
        file: 'article/ESP32C3SuperMini.html',
        date: '2026-03-07'
    },
    {
        id: 'stm32-usb',
        title: 'STM32USB接口',
        file: 'article/STM32USB%E5%8F%A3%E5%90%AF%E7%94%A8%E6%96%B9%E6%B3%95.html',
        date: '2026-04-15'
    },
    {
        id: 'jlc-eda-3d-thickness',
        title: '嘉立创EDA导出3D文件怎么改板厚',
        file: 'article/嘉立创EDA导出3D文件怎么改板厚.html',
        date: '2026-05-03'
    },
    {
        id: 'windows-vista-usable',
        title: 'Windows Vista可以用的东西',
        file: 'article/Windows%20Vista%E5%8F%AF%E4%BB%A5%E7%94%A8%E7%9A%84%E4%B8%9C%E8%A5%BF.html',
        date: '2026-03-03'
    },
];

const friendLinks = [
    {
        name: '鸡仔的博客',
        url: 'https://ias1054.cn',
        avatar: 'favicon.svg',
        description: '记录'
    },
    {
        name: '鸡仔的VibeCode展馆',
        url: 'https://vibe.ias1054.cn',
        avatar: 'favicon.svg',
        description: '展示如何使用ai生成代码'
    }
];

const githubProjects = [
    {
        name: 'daysmatterapi',
        url: 'https://github.com/Jihao2048/daysmatterapi',
        description: '倒数日API，可自定义参数。',
        language: 'HTML'
    },
    {
        name: 'ESP32Partitions',
        url: 'https://github.com/Jihao2048/ESP32Partitions',
        description: 'ESP32分区表CSV文件下载',
        language: 'C++'
    },
    {
        name: 'profile',
        url: 'https://github.com/Jihao2048/profile',
        description: '个人介绍网页模板可用于个人网站，MIT协议随便修改不用署名',
        language: 'HTML'
    }
];